import React from "react";

const Articles = () => {
  return (
    <div>
      <h1>מאמרים</h1>
      <p>
        ברוכים הבאים לאוסף המאמרים שלי, שמוקדשים לדרכי טיפול במגוון הפרעות
        ואתגרים נפשיים באמצעות פסיכותרפיה קוגניטיבית-התנהגותית (CBT). כאן תוכלו
        ללמוד על חרדה, דיכאון, נויסות רגשי, ועוד. כל מאמר מספק הסבר מעמיק על
        ההפרעה והטכניקות הייחודיות של CBT המוכחות כיעילות בטיפול. אני מזמינה
        אתכם לקרוא ולהכיר את הדרכים שבהן ניתן לשפר את איכות החיים ולמצוא איזון
        נפשי.
      </p>
    </div>
  );
};

export default Articles;
