import React from "react";
import eatingAlt from "../../assets/eating.png";
import eating from "../../assets/eating.avif";
import "./Article.css";

const EmotionalEating = () => {
  return (
    <div className="page">
      <div className="page-text">
        <h1>אכילה רגשית </h1>
        <p>
          <picture>
            <source srcSet={eating} type="image/avif" />
            <img
              src={eatingAlt}
              alt="Eating Image"
              className="floating-image"
            />
          </picture>
          האם אי פעם מצאתם את עצמכם פונים למקרר אחרי יום מתסכל בעבודה? האם אתם אוכלים חטיף מתוק כשאתם מרגישים עצב או מתח?
          <br />
          אם עניתם בחיוב על אחת מהשאלות הללו, ייתכן שאתם חווים תופעה שנקראת "אכילה רגשית". תופעה זו נפוצה יותר ממה שנדמה, ומשפיעה על מיליוני אנשים ברחבי העולם. אבל מהי בעצם אכילה רגשית, ואיך אפשר להתמודד איתה?
          <br />
          אכילה רגשית מתרחשת כאשר אנשים פונים לאוכל לא כתגובה לרעב פיזי, אלא כדרך להתמודד עם רגשות שליליים כמו עצב, בדידות, חרדה או שעמום. במקרים רבים, אנשים אינם מודעים לכך שהאוכל משמש עבורם כלי לוויסות רגשי, ולא פתרון לרעב אמיתי.
        </p>
        <p>
          מעבר לשעמום וללחץ נפשי, קיימים גורמים נוספים שמובילים לאכילה רגשית. לדוגמה, דפוסים משפחתיים, תהליכי למידה מוקדמים והקשרים שנבנים בין אוכל לנחמה יכולים להוביל לאכילה כתגובה לרגשות. אנשים שלמדו כבר בילדותם שאוכל משמש כתגמול או נחמה עשויים לפתח תגובה אוטומטית שבה הם פונים לאוכל בכל פעם שהם חווים עצב, מתח או כעס.(Mills, Newman, Cossar, & Murray, 2017). גם מתח כרוני וחרדה הם גורמים מרכזיים לאכילה רגשית, שכן הורמון הקורטיזול שמופרש במצבי דחק מגביר את הדחף למאכלים מתוקים ושומניים, וכך האוכל הופך לכלי נגיש להתמודדות עם רגשות לא נעימים.
          <br />
          במחקר שנערך בקרב סטודנטים בישראל ב-2024 נמצא כי אכילה רגשית נפוצה יותר בקרב נשים, צעירים ואנשים שאינם מרוצים מגופם. סטודנטים ללא ילדים נטו לאכול מתוך רגש יותר מאלה עם ילדים, אולי בשל אחריות הורית שמכתיבה סדר יום מובנה יותר. בנוסף, BMI גבוה, חוסר שביעות רצון מהגוף ושימוש נרחב ברשתות חברתיות נמצאו קשורים לרמות גבוהות יותר של אכילה רגשית. החוקרים מציינים כי מצבי לחץ חריגים כמו מלחמה עשויים להחמיר את הדפוסים האלה – במיוחד כשאין כלים אחרים לוויסות רגשי. (Levin, Yaroslavsky, & Levi, 2024)
        </p>
        <p>
          כולנו מודעים להשלכות הפיזיות של אכילה רגשית הכוללות בעיות בריאותיות כמו השמנה, סוכרת ומחלות לב. אך קיימות גם השלכות רגשיות. אנשים רבים חשים אשמה ובושה לאחר התקפי אכילה רגשית, מה שמחזק את מעגל האכילה ויוצר דפוס שקשה לשבור.
        </p>
        <p>
          עם זאת, חשוב לזכור שאכילה רגשית היא תגובה אנושית. כשקשה לנו וטיפול קוגניטיבי-התנהגותי (CBT) יכול לעזור לעצור את המעגל הזה: להבין מה מפעיל אותו, לעבוד עם הרגש ולא נגדו, ולבנות דרכי התמודדות אחרות, שיש בהן מקום גם לרגש וגם לבחירה.
        </p>
        <p>
          אם המאמר הזה דיבר אליך, אני מזמינה אותך להתייעץ אתי.
        </p>
        <div className="sources">
          <h3>מקורות</h3>
          <p>
            Levin, N., Yaroslavsky, A., & Levi, E. (2024). Emotional Eating among College Students in Israel: A Study during Times of War. Foods, 13(9), 1347. https://www.mdpi.com/2304-8158/13/9/1347
          </p>
          <p>Mills, J. S., Newman, D. L., Cossar, K. D., & Murray, R. J. (2017). Rewarding food with food: Parental use of food as a reward in childhood predicts emotional eating and cognitive restraint in adulthood. Child Development, 88(6), 1684–1698. https://doi.org/10.1111/cdev.12756
          </p>
        </div>
      </div>
    </div>
  );
};

export default EmotionalEating;
