import React from "react";

const About = () => {
  return (
    <div className="page">
      <h1>אודותי</h1>

      <p>
        נעים להכיר, אני ענבל שאול, פסיכותרפיסטית קוגניטיבית-התנהגותית. אני מטפלת
        ומלווה במצבי קושי ומשבר כמו חרדה, דיכאון, הפרעות התנהגות שונות, התמודדות
        עם כעסים, תחושת ערך עצמי נמוך, תחושת תקיעות, קושי בניהול מערכות יחסים
        ועוד. אני מטפלת בגישה הקוגניטיבית התנהגותית, המתייחסת לקשר שבין מחשבות,
        רגשות והתנהגות. אני מאמינה שבאמצעות הקשבה והתבוננות משותפת ללא שיפוטיות
        אפשר לצמוח.
      </p>
      <p>
        מאז ומתמיד נמשכתי לעולם הנפש ורציתי להבין איך אנחנו חושבים, מרגישים
        ופועלים. את המסע המקצועי שלי התחלתי בלימודי פסיכולוגיה, שם גיליתי את
        המורכבות האנושית וכיצד היא משפיעה על חיינו. בהמשך הדרך, בחרתי להרחיב את
        הידע שלי בתחום החינוך המיוחד, מה שעזר לי להבין יותר לעומק את הצרכים
        הייחודיים של כל אדם. את ההסמכה שלי ב-CBT, קיבלתי ממכון פסגות. אני מאוד
        מאמינה בגישה הקוגניטיבית התנהגותית. תוכלו לקרוא עליה כאן.
      </p>
      <p>
        ההשראה שלי ללמוד ולהתמחות ב-CBT הגיעה מתוך הרצון לעזור לאנשים למצוא את
        הכוחות שלהם בתוכם ולראות את השינוי מתרחש מול עיניהם. אני מאמינה שכל אחד
        מאיתנו יכול לחיות חיים מלאים ומאושרים יותר, ושביחד נוכל למצוא את הדרך
        לשם. אני מזמינה אותך לפנות אליי כדי לחוות את הדרך הייחודית הזו לשיפור
        החיים, ואני כאן כדי לתמוך וללוות אותך בכל שלב במסע הזה.
      </p>
    </div>
  );
};

export default About;
