import React from "react";
import inbalAlt from "../assets/inbal.jpeg";
import inbal from "../assets/inbal.avif";
import "./Articles/Article.css";

const About = () => {
  return (
    <div className="page">
      <div className="page-text">
        <h1>מי אני</h1>
        <p>
          <picture>
            <source srcSet={inbal} type="image/avif" />
            <img src={inbalAlt} alt="Inbal Image" className="floating-image" />
          </picture>
          נעים להכיר, אני ענבל שאול, פסיכותרפיסטית קוגניטיבית-התנהגותית. אני
          מלווה ומטפלת במצבי קושי ומשבר כגון חרדה, דיכאון, הפרעות התנהגות,
          התמודדות עם כעסים, תחושת ערך עצמי נמוך, תקיעות, קשיים בניהול מערכות
          יחסים ועוד. אני מאמינה שמכל משבר וקושי אפשר לצמוח ולהתפתח. במהלך
          הטיפול נתבונן ונחקור את הקשר בין מחשבות, רגשות והתנהגויות. נבחן יחד
          כלים מעשיים שיסייעו לך לחוות את השינוי הרצוי ולהתמודד עם האתגרים בצורה
          מיטיבה יותר.
        </p>
        <p>
          מאז ומתמיד נמשכתי לעולם הנפש ורציתי להבין איך אנחנו חושבים, מרגישים
          ופועלים. את המסע המקצועי שלי התחלתי בלימודי פסיכולוגיה, שם גיליתי את
          המורכבות האנושית וכיצד היא משפיעה על חיינו. בהמשך הדרך, בחרתי להרחיב
          את הידע שלי בתחום החינוך המיוחד, מה שעזר לי להבין יותר לעומק את הצרכים
          הייחודיים של כל אדם. את ההסמכה שלי ב-CBT, קיבלתי ממכון פסגות. אני מאוד
          מאמינה בגישה הקוגניטיבית התנהגותית. תוכלו לקרוא עליה{" "}
          <span>
            <a href="/CBT">כאן</a>
          </span>
          .
        </p>
        <p>
          ההשראה שלי ללמוד ולהתמחות ב-CBT הגיעה מתוך הרצון לעזור לאנשים למצוא את
          הכוחות שלהם בתוכם ולראות את השינוי מתרחש מול עיניהם. אני מאמינה שכל
          אחד מאיתנו יכול לחיות חיים מלאים ומאושרים יותר, ושביחד נוכל למצוא את
          הדרך לשם. אני מזמינה אותך לפנות אליי כדי לחוות את השיפור, ואני כאן כדי
          לתמוך וללוות אותך בכל שלב במסע הזה.
        </p>
      </div>
    </div>
  );
};

export default About;
